[
  {
    "id": "ws-1",
    "title": "Desert Pulse: Rhythm of the Body",
    "description": "In the harsh desert world of Arrakis from the Dune universe, survival is not about excess but about discipline, balance, and adaptation. The Fremen survive extreme conditions by training their bodies intelligently—never wasting energy, never overexerting, and always adapting to their environment. Modern fitness applications, however, are overwhelming and unrealistic for beginners. They assume unlimited motivation, equipment, and time. Desert Pulse reimagines fitness through the philosophy of Dune by offering minimal, adaptive, and achievable workout routines that align with a user's real-life constraints.",
    "objective": "Build an adaptive fitness application that offers minimal, personalized, and achievable workout routines based on user constraints, tracking progress and encouraging consistency through intelligent adaptation.",
    "basicFeatures": [
      "Authentication: Users can log in using email and password or a dummy login system.",
      "User Profile: Users enter basic details such as name, fitness goal, and available daily workout time.",
      "Fixed Workout Plans: Predefined workouts are shown based on selected goals.",
      "Today's Workout Screen: Displays the daily workout plan with a button to mark completion.",
      "Simple Navigation: A clear flow from login to workout ensures ease of use.",
      "Energy Level Selection: Users specify how energetic they feel, enabling adaptive workout intensity.",
      "Google Authentication: Allows users to sign in quickly using their Google account.",
      "Progress Tracking: Tracks workout streaks and total sessions completed."
    ],
    "advancedFeatures": [
      "GenAI Workout Generator: AI generates workout routines based on user goals, time availability, and location (home or gym).",
      "Adaptive Training Logic: The system dynamically adjusts workout difficulty based on user performance history.",
      "Notifications: Sends reminders for daily workouts and alerts when workouts are missed.",
      "Basic ML or Rule-Based Learning: The app learns patterns such as skipped workouts and adapts future plans accordingly.",
      "AI Coach: Provides conversational or voice-based explanations of exercises and motivation.",
      "Weekly Fitness Report: Summarizes user activity, consistency, and estimated calories burned.",
      "Security Enhancements: Includes protected routes and token-based authentication."
    ]
  },
  {
    "id": "ws-2",
    "title": "Sietch of Minds: Alliances of Knowledge",
    "description": "Design and develop a web-based peer learning platform set in the universe of Arrakis, where survival and growth depend on alliances, trust, and shared wisdom. Users represent members of different Houses, each offering skills they can teach and seeking skills they wish to learn. Through structured requests, guided sessions, and reputation-driven trust, the platform enables meaningful knowledge exchanges, much like forging strategic alliances in the desert.",
    "objective": "Create a peer learning platform where users can teach and learn from each other, building reputation through completed sessions and ratings while fostering a community of shared knowledge.",
    "basicFeatures": [
      "User Profile: Create a House identity with skills, interests, and reputation.",
      "Skills I Can Teach: List knowledge or expertise available to share.",
      "Skills I Want to Learn: Specify skills the user is seeking to acquire.",
      "Search by Skill: Discover compatible peers based on teachable skills.",
      "Send Request: Initiate a learning exchange with another House member.",
      "Accept / Reject Request: Manage incoming learning alliance requests.",
      "Mark Session Completed: Close learning sessions after successful exchange.",
      "Peer Rating (1-5): Rate collaborators to build trust and reputation."
    ],
    "advancedFeatures": [
      "AI Session Summaries: Automatically generate learning summaries after sessions.",
      "Recommendation Engine: Suggest mentors and learners based on skills and ratings.",
      "Analytics Dashboard: Visualize learning activity, reputation growth, and skill trends."
    ]
  },
  {
    "id": "ws-3",
    "title": "Spicepath: Journey Through the Dunes",
    "description": "In the shifting dunes of event planning, success is not measured by scale, but by vision, foresight, and the ability to adapt. Like Fremen navigating the deserts of Arrakis, organizers must master scarce resources, anticipate change, and turn each challenge into a lasting impression. Every event is a dune—shaped by experience, molded by strategy, and alive with movement. Yet, fragmented tools leave schedules adrift, registrations tangled, and engagement fleeting, like spice lost to the winds. Attendees struggle to find their path, missing moments that matter. OasisEvent rises as the AI-powered sietch in this desert of chaos—a sanctuary where organizers sculpt seamless experiences and attendees navigate with clarity. From creation and registration to real-time updates, communication, and post-event insights, the platform transforms scattered elements into harmony. Every event becomes a spice-rich landmark, forged with precision, flow, and mastery, leaving a lasting mark on both organizers and participants.",
    "objective": "Build an AI-driven event management platform that streamlines the entire event lifecycle—from planning and registration to execution and analysis—empowering organizers with intelligent tools and providing attendees with seamless, personalized experiences.",
    "basicFeatures": [
      "Secure Authentication: Email/Google login with role-based access for organizers and attendees.",
      "Event Discovery & Booking: Search, filter, register, book tickets, and track events.",
      "AI-Assisted Creation: AI generates event details, schedules, and tickets from minimal input.",
      "Attendance Tracking & Coordination: Real-time check-ins, announcements, and attendee notifications.",
      "Organizer Dashboard & Insights: View attendance, performance metrics, ratings, and feedback."
    ],
    "advancedFeatures": [
      "AI-Driven Event Recommendations: Suggest relevant events to users based on past participation and interests.",
      "Advanced Analytics Dashboard: Visualize popular events, registration trends, and attendance flow for data-driven decisions.",
      "QR-Code Based Check-In: Enable fast and secure event entry using QR codes with offline sync support.",
      "Intelligent Automation: Automate reminders, follow-ups, email and push notifications, and dynamic ticket pricing.",
      "Smart Resource Management: Manage vendors, speakers, sponsors, access roles, and handle high-traffic situations securely.",
      "Smart Networking & Matchmaking: AI-generated attendee connection suggestions for conferences and meetups based on shared interests and event participation.",
      "Post-Event Reflection Engine: Automatically generated post-event reports highlighting key outcomes, challenges, and improvement areas for future events."
    ]
  },
  {
    "id": "ws-4",
    "title": "Mentat Trials: Code of the Desert",
    "description": "Inspired by the rigorous trials and discipline depicted in Dune, design and implement a web-based Online Judge Platform where users prove their mastery through coding challenges. The platform should allow users to register, browse a categorized problem library, write and execute code in an integrated editor, and submit solutions for evaluation against hidden test cases. Users must be able to track their submission history, acceptance status, and coding streaks. To simulate the guidance of Mentats, the platform should provide AI-powered feedback after submissions, explaining failures and suggesting improvements. Visual dashboards, heatmaps, and performance analytics should help users analyze progress and refine their strategies—mirroring the journey from novice to master on Arrakis.",
    "objective": "Build a coding challenge platform with real-time code execution, AI-powered feedback, and comprehensive progress tracking to help developers improve their problem-solving skills through practice and competition.",
    "basicFeatures": [
      "User & Role Management: Simple login/signup (Email & Password). Two roles: User (solves problems) and Admin (adds problems).",
      "Problem Library: A dashboard listing available problems with titles and difficulty tags (Easy/Medium/Hard).",
      "Problem Detail Page: Shows description, constraints, and sample Input/Output.",
      "Integrated Coding Workspace: Browser-based code editor with a Run button to execute code via external API.",
      "Submission System: Submit code for evaluation against hidden test cases and store submission history (Date, Problem Name, Status)."
    ],
    "advancedFeatures": [
      "AI-Tutor Feedback: After submission, AI explains why code failed and suggests optimizations via Google Gemini or OpenAI API.",
      "Visual Activity Heatmap: Grid on user profile showing coding activity (e.g., green squares for days with submissions).",
      "Dynamic Streak Counter: Tracks consecutive days with 'Accepted' submissions.",
      "Basic Performance Analytics: Pie chart showing percentage of problems solved by category.",
      "Social Features: Comment section under each problem for hints and discussions.",
      "Cross-Platform Dashboard: Connect other coding platforms for unified analytics."
    ]
  },
  {
    "id": "ws-5",
    "title": "Arrakis Signal: Voices of the Desert",
    "description": "On the desert world of Arrakis, even the smallest civic failure—cracked roads, broken water lines, uncollected waste—can quickly disrupt daily life. These issues often remain buried under shifting sands due to delayed reporting, poor coordination, and lack of transparency. The Council of Arrakis seeks a unified digital system where citizens can raise concerns and municipal authorities can respond efficiently. Every complaint is treated as a signal from the desert, tracked from its origin to resolution. Your task is to build Arrakis Signal, a web-based civic complaint management platform that enables seamless reporting, structured resolution workflows, and data-driven governance—restoring balance and accountability across the city.",
    "objective": "Develop a civic engagement platform that enables citizens to report issues, track resolution progress, and hold authorities accountable through transparent workflows and real-time updates.",
    "basicFeatures": [
      "User Registration & Login: Secure authentication for citizens and officials.",
      "Complaint Submission: Report issues with text, location, category, and optional photo upload.",
      "Ticket Lifecycle: Complaints move through defined stages.",
      "Municipal Dashboard: Staff can view, assign, and update complaint status and remarks.",
      "Search & Filtering: Filter complaints by type, locality, urgency, or submission date.",
      "Citizen Portal: Users can track their complaints and view real-time status updates.",
      "Role-Based Access: Separate dashboards for citizens, municipal staff, and administrators.",
      "Reports & Export: Generate CSV/PDF reports for periodic analysis and record-keeping."
    ],
    "advancedFeatures": [
      "Heatmap Visualization: Interactive map showing complaint density across localities.",
      "SLA Tracking: Monitor resolution time and flag complaints nearing or exceeding deadlines.",
      "Escalation System: Automatically escalate unresolved issues to higher authorities.",
      "Public Transparency Portal: Display live statistics such as resolved vs pending issues.",
      "Notifications System: SMS, email, or push alerts for status changes and overdue complaints.",
      "Priority Tagging: Mark critical issues (safety, water, health) for faster resolution.",
      "Analytics Dashboard: Insights on complaint trends, workload, and department performance."
    ]
  },
  {
    "id": "ws-6",
    "title": "HouseVault: Records of the Future",
    "description": "In the Dune universe, powerful houses survive not only through force but through preparation, records, and secure information. Medical knowledge, lineage records, and emergency planning determine survival. In modern families, important documents and information are scattered across phones, cupboards, and chat applications, making them difficult to access during emergencies. FamVault applies the Dune philosophy of control and preparedness by creating a centralized, digital family locker room that is simple, secure, and accessible.",
    "objective": "Create a family information management system that securely organizes important documents, medical details, and emergency contacts while providing intelligent alerts and easy access during critical situations.",
    "basicFeatures": [
      "Authentication: Email and password login for a single family account to introduce basic access control.",
      "Family Dashboard: Clearly divided sections for documents, medical details, emergency contacts, and notes.",
      "Add and View Data: Simple forms allow users to store and retrieve information easily.",
      "Local or Dummy Storage: Enables development without cloud infrastructure.",
      "Clean Locker-Style UI: A folder-based interface improves usability and clarity.",
      "Google Authentication: Allows multiple family members to join securely using Google login.",
      "Family Roles: Admin and member roles define who can view or edit information."
    ],
    "advancedFeatures": [
      "Reminders and Notifications: Alerts users about medicine schedules, bill payments, and important dates.",
      "Search and Filter: Helps users quickly locate stored information.",
      "AI Auto-Categorization: Automatically organizes uploaded data into appropriate sections.",
      "Smart Expiry Alerts: Detects and alerts users about expiring documents or prescriptions.",
      "ML-Based Suggestions: Suggests missing or commonly required family documents.",
      "Emergency Mode: Provides one-tap access to critical medical and contact information.",
      "Security Enhancements: Role-based access control and conceptual encryption for stored data."
    ]
  },
  {
    "id": "ws-7",
    "title": "Arrakis Market: Trade of the Sands",
    "description": "In the harsh dunes of Arrakis, technology determines survival. Devices must endure heat, dust, signal loss, and power constraints, yet today's electronics marketplace overwhelms users with fragmented specifications and unreliable comparisons. Arrakis Market is an AI-powered electronics marketplace inspired by Electronics & Communication Engineering, where devices are analyzed for performance, reliability, and environmental tolerance. Acting as a digital navigator, the platform converts raw technical data into clear recommendations, predictive reliability insights, and smart financial planning. By bringing structure, intelligence, and control to device discovery and management, the system guides users through the technological sands with confidence and clarity.",
    "objective": "Create an electronics comparison and marketplace platform that helps users make informed purchasing decisions through detailed technical analysis, AI-powered recommendations, and environmental performance forecasting.",
    "basicFeatures": [
      "Device Catalog: Electronics listing with ECE specs, ratings.",
      "Search & Filters: Filter by category, chipset, sensors, power, and price.",
      "Device Comparison: Side-by-side comparison of specs, performance, and cost.",
      "EMI Calculator: Real-time installment and total cost estimation.",
      "User Accounts: Secure login, profiles, and saved preferences.",
      "Responsive Design: Desert-inspired UI across all devices."
    ],
    "advancedFeatures": [
      "AI Recommendations: Suggest similar or better devices using spec matching.",
      "Admin Dashboard: Manage devices, inventory, sellers, and listings.",
      "AI Image Listings: Auto-generate listings from uploaded device images.",
      "AI Financial Insights: Smart EMI optimization and affordability analysis.",
      "Seller Controls: Admin-managed approvals, access, and workflows.",
      "Environmental Analysis: Predict reliability under heat, dust, and signal stress.",
      "Performance Forecasting: AI-based longevity and efficiency scoring."
    ]
  },
  {
    "id": "ws-8",
    "title": "Sands of the Mind: An AI Journal of Reflection",
    "description": "Build an AI-powered journal inspired by Arrakis, where the mind is seen as a vast, shifting desert and every thought leaves a quiet imprint in the sand. In this inner landscape, users capture reflections through text or voice, while AI remains a silent companion—offering gentle, timely prompts to help navigate changing emotional terrains without intrusion. As days pass, the system begins to trace emotional rhythms and recurring thought patterns, much like dunes slowly shaped by wind, time, and experience. Moments of stillness, turbulence, and growth are mapped and summarized, allowing users to see how their inner world evolves rather than feeling lost within it. By visualizing emotional trends and distilling reflections into meaningful insights, the platform helps users cultivate clarity, resilience, and self-awareness. Guided by the Fremen philosophy of balance, awareness, and intentional living, and grounded in strong privacy and user control, the journal transforms scattered thoughts into a deeper understanding of the self.",
    "objective": "Develop a privacy-first AI journaling platform that helps users track emotions, identify patterns, and gain self-awareness through intelligent reflection tools, mood visualization, and personalized insights—all while maintaining complete user control over their data.",
    "basicFeatures": [
      "Secure Authentication & Profiles: Google login with encrypted journals and Dune-inspired profiles.",
      "Journal Management: Create, edit, and delete text or voice entries with smart tags.",
      "AI Reflection & Mood Tracking: AI prompts with emotion tracking visualized over time.",
      "Search & Offline Access: Filter entries by date, tags, or mood with offline sync.",
      "Summaries & Export: AI summaries, reminders, backups, and PDF/CSV exports.",
      "Social Sharing: Share entries on social platforms with full privacy control."
    ],
    "advancedFeatures": [
      "AI-Driven Emotional Trend Analysis: Reveal emotional patterns, behavioral shifts, and long-term introspective insights across journal entries.",
      "Personalized Insights & Smart Prompts: Emotion-aware AI summaries and next-step reflection prompts based on past entries.",
      "Contextual Growth Suggestions: AI-generated suggestions for habits, goals, self-growth actions, and semantic tag recommendations.",
      "Advanced Personalization & Sync: Cross-device sync with seamless cloud backup, custom themes, visual journaling, images, fonts, and color-coded emotions.",
      "Predictive Reflection Guidance: Emotional pattern forecasting, predictive journaling prompts, and integration with health or mindfulness data.",
      "Sentiment Alerts & Engagement Tools: AI sentiment alerts for critical emotions, writing streak gamification, mood heatmaps, and journaling network recommendations."
    ]
  }
]